---
kind: property
id: P:Autodesk.Revit.DB.Definitions.IsEmpty
source: html/26c02df4-60cc-6e57-eaa6-96c58044b466.htm
---
# Autodesk.Revit.DB.Definitions.IsEmpty Property

Identifies if the definitions collection is empty.

## Syntax (C#)
```csharp
public bool IsEmpty { get; }
```